////////////////////////////////////////////////////////////////////////
/*Задача 21
Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

A (3,6,8); B (2,1,-7), -> 15.84
A (7,-5, 0); B (1,-1,9) -> 11.53*/
    Console.Clear();
    Console.Write("Введите значение координаты X первой точки: "); 
    int X1 = int.Parse(Console.ReadLine());
    Console.Write("Введите значение координаты Y первой точки: "); 
    int Y1 = int.Parse(Console.ReadLine());  
    Console.Write("Введите значение координаты Z первой точки: "); 
    int Z1 = int.Parse(Console.ReadLine());      
    Console.Write("Введите значение координаты X второй точки: "); 
    int X2 = int.Parse(Console.ReadLine());
    Console.Write("Введите значение координаты Y второй точки: "); 
    int Y2 = int.Parse(Console.ReadLine()); 
    Console.Write("Введите значение координаты Z второй точки: "); 
    int Z2 = int.Parse(Console.ReadLine());

    Console.WriteLine($"Расстояние между точкой с координатами ({X1},{Y1},{Z1}) и точкой с координатами ({X2},{Y2},{Z2}) составляет: {Math.Sqrt(Math.Pow(X2-X1,2) + Math.Pow(Y2-Y1,2)+ Math.Pow(Z2-Z1,2)):f2}");
/////////////////////////////////////////////////////////////////////////  