/////////////////////////////////////////////////////////////////////////////
/*Задача 19
Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

14212 -> нет
12821 -> да
23432 -> да 
    /* РЕШЕНИЕ МЕТОДОМ СТРОК*/
       
    Console.Write("Введите пятизначное число для проверки на палиндром: ");
    string pol = Console.ReadLine();
    if(pol[0] == '-') {pol=pol.Substring(1);}  
    if (!int.TryParse(pol, out int y))
      {
        Console.Write("Вы ввели не число");
      }
    else 
    {
      int n=-1;  
      for (int i=0; i<=pol.Length/2; i++)
        { 
          if (pol[i]==pol[pol.Length-1-i])
            {
              n=1;
            }
          else {n=0; break;}
        }
      if (n==1)
        {
          Console.Write("да"); 
        }
      else 
        {
          Console.Write("нет");
        }
    }   
///////////////////////////////////////////////////////////////////////////    
