////////////////////////////////////////////////////////////////////////
/*Задача 23
    Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125*/
    Console.Clear();
    Console.Write("Введите положительное число: ");
    int N = int.Parse(Console.ReadLine());
    if (N<1)
      {
        Console.WriteLine("Вы ввели не положительное число :(");
      }
    else
      {
        Console.WriteLine($"Таблица кубов от 1 до {N}: ");
        int i=1; 
        while (i<=N)
          {
            Console.Write($"{Math.Pow(i,3)} ");
            i++;        
          }
      }
/////////////////////////////////////////////////////////////////////////